Creating a data frame

VIT has conducted technical events for the students. It maintains the name of the participant and the score obtained in different events.
    1. Create a data frame by considering 5 students and 4 events. Each event has a maximum score of 10. If a student participates in an event, its entry contains the score value and 0 otherwise.
    2. Append a column to include the total score of the participants
    3. Find the maximum score and display the name of the participant who scored it.
    4. Compute the average score of each event and append it as a new row in the data frame.

In [15]:
df <- data.frame(id=c(1,2,3,4,5),name=c("Ann","Ram","Krish","Shewtha","Meenu"),Event1=c(10,0,10,8,9),Event2=c(9,8,7,0,9),Event3=c(7,9,0,4,0),Event4=c(9,0,7,0,8))
df

  id name    Event1 Event2 Event3 Event4
1 1  Ann     10     9      7      9
2 2  Ram      0     8      9      0
3 3  Krish   10     7      0      7
4 4  Shewtha  8     0      4      0
5 5  Meenu    9     9      0      8

In [16]:
df$Total <- rowSums(df[3:6])
df

  id name    Event1 Event2 Event3 Event4 Total
1 1  Ann     10     9      7      9      35
2 2  Ram      0     8      9      0      17
3 3  Krish   10     7      0      7      24
4 4  Shewtha  8     0      4      0      12
5 5  Meenu    9     9      0      8      26

In [17]:
max(df$Total)

[1] 35

In [18]:
df$name[which.max(df$Total)]

[1] Ann
Levels: Ann Krish Meenu Ram Shewtha

In [20]:
df <- rbind(df,data.frame(id=4,name="avgscore",Event1=mean(df$Event1),Event2=mean(df$Event2),Event3=mean(df$Event3),Event4=mean(df$Event4),Total=mean(df$Total)))
df

  id name     Event1 Event2 Event3 Event4 Total
1 1  Ann      10.0   9.0    7      9.0    35.0
2 2  Ram       0.0   8.0    9      0.0    17.0
3 3  Krish    10.0   7.0    0      7.0    24.0
4 4  Shewtha   8.0   0.0    4      0.0    12.0
5 5  Meenu     9.0   9.0    0      8.0    26.0
6 4  avgscore  7.4   6.6    4      4.8    22.8

Indexing and Slicing data frames

    5. Access the scores of participants in event2 using the column name.
    6. Use index number to retrieve the same data.
    7. Extract the score of third participant in event3.
    8. Extract the scores of the first and second participant in all the events.
    9. Display the names and total scores of all participants.
    10. Make the column “name” as the row index of the data frame.
    11. Display the names of the students participated in event3.
    12. Obtain the names whose total score is above its average.

In [22]:
df[,c("name","Event2")]#Access the scores of participants in event2 using the column name.

  name     Event2
1 Ann      9.0
2 Ram      8.0
3 Krish    7.0
4 Shewtha  0.0
5 Meenu    9.0
6 avgscore 6.6

In [23]:
subset <- df[c(2,4)]#Use index number to retrieve the same data.
subset

  name     Event2
1 Ann      9.0
2 Ram      8.0
3 Krish    7.0
4 Shewtha  0.0
5 Meenu    9.0
6 avgscore 6.6

In [24]:
df[3,5]#Extract the score of third participant in event3

[1] 0

In [25]:
df[1:2,3:6]#Extract the scores of the first and second participant in all the events.

  Event1 Event2 Event3 Event4
1 10     9      7      9
2  0     8      9      0

In [26]:
#Display the names and total scores of all participants.
p2 <- df[c(2,7)]
p2

  name     Total
1 Ann      35.0
2 Ram      17.0
3 Krish    24.0
4 Shewtha  12.0
5 Meenu    26.0
6 avgscore 22.8

In [69]:
df2 <- df[-2]
df2

  id Event1 Event2 Event3 Event4 Total
1 1  10.0   9.0    7      9.0    35.0
2 2   0.0   8.0    9      0.0    17.0
3 3  10.0   7.0    0      7.0    24.0
4 4   8.0   0.0    4      0.0    12.0
5 5   9.0   9.0    0      8.0    26.0
6 4   7.4   6.6    4      4.8    22.8

In [70]:
row.names(df2) <- df$name
df2

         id Event1 Event2 Event3 Event4 Total
Ann      1  10.0   9.0    7      9.0    35.0
Ram      2   0.0   8.0    9      0.0    17.0
Krish    3  10.0   7.0    0      7.0    24.0
Shewtha  4   8.0   0.0    4      0.0    12.0
Meenu    5   9.0   9.0    0      8.0    26.0
avgscore 4   7.4   6.6    4      4.8    22.8

In [72]:
#Obtain the names whose total score is above its average.
row.names(df2)[df2$Total>22.8]

[1] "Ann"   "Krish" "Meenu"

In [73]:
#Display the names of the students participated in event3.
row.names(df2)[df2$Event1>0.0 & df2$Event2>0.0 & df2$Event3>0.0 & df2$Event4>0.0]

[1] "Ann"      "avgscore"

Basic Operations in data frame

In [38]:
library (MASS)
data(survey)
head(survey)

  Sex    Wr.Hnd NW.Hnd W.Hnd Fold    Pulse Clap    Exer Smoke Height M.I
1 Female 18.5   18.0   Right R on L   92   Left    Some Never 173.00 Metric
2 Male   19.5   20.5   Left  R on L  104   Left    None Regul 177.80 Imperial
3 Male   18.0   13.3   Right L on R   87   Neither None Occas     NA NA
4 Male   18.8   18.9   Right R on L   NA   Neither None Never 160.00 Metric
5 Male   20.0   20.0   Right Neither  35   Right   Some Never 165.00 Metric
6 Female 18.0   17.7   Right L on R   64   Right   Some Never 172.72 Imperial
  Age
1 18.250
2 17.583
3 16.917
4 20.333
5 23.667
6 21.000

In [39]:
str(survey)#Display the structure of the data survey.

'data.frame':	237 obs. of  12 variables:
 $ Sex   : Factor w/ 2 levels "Female","Male": 1 2 2 2 2 1 2 1 2 2 ...
 $ Wr.Hnd: num  18.5 19.5 18 18.8 20 18 17.7 17 20 18.5 ...
 $ NW.Hnd: num  18 20.5 13.3 18.9 20 17.7 17.7 17.3 19.5 18.5 ...
 $ W.Hnd : Factor w/ 2 levels "Left","Right": 2 1 2 2 2 2 2 2 2 2 ...
 $ Fold  : Factor w/ 3 levels "L on R","Neither",..: 3 3 1 3 2 1 1 3 3 3 ...
 $ Pulse : int  92 104 87 NA 35 64 83 74 72 90 ...
 $ Clap  : Factor w/ 3 levels "Left","Neither",..: 1 1 2 2 3 3 3 3 3 3 ...
 $ Exer  : Factor w/ 3 levels "Freq","None",..: 3 2 2 2 3 3 1 1 3 3 ...
 $ Smoke : Factor w/ 4 levels "Heavy","Never",..: 2 4 3 2 2 2 2 2 2 2 ...
 $ Height: num  173 178 NA 160 165 ...
 $ M.I   : Factor w/ 2 levels "Imperial","Metric": 2 1 NA 2 2 1 1 2 2 2 ...
 $ Age   : num  18.2 17.6 16.9 20.3 23.7 ...

In [40]:
df1  <-  survey

In [42]:
#Get the dimension of the survey data frame.
dim(df1)

[1] 237  12

In [51]:
nrow(df1)#Get the number of rows and columns of the survey data frame.

[1] 237

In [52]:
ncol(df1)#Get the number of rows and columns of the survey data frame.

[1] 12

In [53]:
typeof(df1)#Check the class and type of the data set survey in MASS.

[1] "list"

In [54]:
class(df1)#Check the class and type of the data set survey in MASS.

[1] "data.frame"

In [55]:
#Provide the statistical summary of the data frame.
summary(df1)

     Sex          Wr.Hnd          NW.Hnd        W.Hnd          Fold
 Female:118   Min.   :13.00   Min.   :12.50   Left : 18   L on R : 99
 Male  :118   1st Qu.:17.50   1st Qu.:17.50   Right:218   Neither: 18
 NA's  :  1   Median :18.50   Median :18.50   NA's :  1   R on L :120
              Mean   :18.67   Mean   :18.58
              3rd Qu.:19.80   3rd Qu.:19.73
              Max.   :23.20   Max.   :23.50
              NA's   :1       NA's   :1
     Pulse             Clap       Exer       Smoke         Height
 Min.   : 35.00   Left   : 39   Freq:115   Heavy: 11   Min.   :150.0
 1st Qu.: 66.00   Neither: 50   None: 24   Never:189   1st Qu.:165.0
 Median : 72.50   Right  :147   Some: 98   Occas: 19   Median :171.0
 Mean   : 74.15   NA's   :  1              Regul: 17   Mean   :172.4
 3rd Qu.: 80.00                            NA's :  1   3rd Qu.:180.0
 Max.   :104.00                                        Max.   :200.0
 NA's   :45                                            NA's   :28
       M.I           Age
 Imperial: 68   Min.   :16.75
 Metric  :141   1st Qu.:17.67
 NA's    : 28   Median :18.58
                Mean   :20.37
                3rd Qu.:20.17
                Max.   :73.00

In [58]:
#Display the column names of the survey data frame
names(df1)

 [1] "Sex"    "Wr.Hnd" "NW.Hnd" "W.Hnd"  "Fold"   "Pulse"  "Clap"   "Exer"
 [9] "Smoke"  "Height" "M.I"    "Age"

In [59]:
#Retrieve the top 3 rows from the data frame.
df1[1:3,]

  Sex    Wr.Hnd NW.Hnd W.Hnd Fold   Pulse Clap    Exer Smoke Height M.I
1 Female 18.5   18.0   Right R on L  92   Left    Some Never 173.0  Metric
2 Male   19.5   20.5   Left  R on L 104   Left    None Regul 177.8  Imperial
3 Male   18.0   13.3   Right L on R  87   Neither None Occas    NA  NA
  Age
1 18.250
2 17.583
3 16.917

In [62]:
#Extract the bottom 2 rows from the data frame.
tail(df1, 2)

    Sex    Wr.Hnd NW.Hnd W.Hnd Fold   Pulse Clap  Exer Smoke Height M.I
236 Male   21.0   21.5   Right R on L 90    Right Some Never 183.0  Metric
237 Female 17.6   17.3   Right R on L 85    Right Freq Never 168.5  Metric
    Age
236 17.167
237 17.750